ExchangePlans/СинхронизацияДанныхЧерезУниверсальныйФормат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ExchangePlan>
		<Properties>
			<Name>СинхронизацияДанныхЧерезУниверсальныйФормат</Name>
			<Comment>Синхронизация данных через универсальный формат</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЦеныНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоТипамДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОтправкиДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОтправкиСправочников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКМенеджеруОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиСправочников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСписаниеПриОтпускеВОтделениеБезСкладскогоУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыгружаемыеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦенНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦенНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/СинхронизацияДанныхЧерезУниверсальныйФормат/Forms/НастройкаВыгрузки/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Форма параметризуется:
//  УзелИнформационнойБазы - ПланОбменаСсылка - узел обмена, для которого происходит настройка
//  ПериодОтбора           - СтандартныйПериод - общий период отбора
//  Отбор                  - ДанныеФормыКолелкция, ТаблицаЗначений - описание отбора для редактирования.
//                           При описании отбора используются колонки:
//                             * ПолноеИмяМетаданных - Строка                - имя метаданных, для отбора.
//                             * Отбор               - ОтборКомпоновкиДанных - описание отбора.
//                             * ВыборПериода        - Булево                - Истина, если применим общий период отбора.
//                             * Период              - СтандартныйПериод     - общий период отбора для строки.
//
// Форма должна вернуть результат выбора - структуру с полями:
//  ПериодОтбора        - СтандартныйПериод - общий период выбора, если используется
//  Отбор               - ДанныеФормыКоллекция - заполненные данные.
//                        Используются колонки аналогичные входному параметру:
//                          * ПолноеИмяМетаданных - Строка                - имя метаданных, для отбора.
//                          * Отбор               - ОтборКомпоновкиДанных - описание отбора.
//                          * ВыборПериода        - Булево                - Истина, если применим общий период отбора.
//                          * Период              - СтандартныйПериод     - общий период отбора для строки.
//  ПредставлениеОтбора - Строка - текстовое описание отбора.
//
// Примечание:
//  Реквизит формы ТаблицаОтбора типа ДанныеФормыКоллекция
//  используется для передачи коллекции Отбор, с возможностью сериализации,
//  т.к. возврат результата выполняется на клиент.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелИнформационнойБазы = Параметры.УзелИнформационнойБазы;
	ПериодОтбора           = Параметры.ПериодОтбора;
	
	ИнициализироватьСписокОрганизаций(УзелИнформационнойБазы, Параметры.Отбор);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьОтмеченные(Команда)
	
	ОповеститьОВыборе(РезультатВыбора());
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

//////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьСписокОрганизаций(УзелИнформационнойБазы, Знач ТаблицаОтбора)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ПланОбмена.Ссылка                           КАК Ссылка,
	|	ПланОбмена.ИспользоватьОтборПоОрганизациям  КАК ИспользоватьОтборПоОрганизациям
	|ПОМЕСТИТЬ ПланОбмена
	|ИЗ
	|	#ПланОбмена КАК ПланОбмена
	|ГДЕ
	|	ПланОбмена.Ссылка = &Получатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПланаОбмена.Организация  КАК Организация
	|ИЗ
	|	ПланОбмена КАК ПланОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			#ОрганизацииПланаОбмена КАК ОрганизацииПланаОбмена
	|		ПО
	|			ОрганизацииПланаОбмена.Ссылка = ПланОбмена.Ссылка
	|			И ПланОбмена.ИспользоватьОтборПоОрганизациям
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка  КАК Организация
	|ИЗ
	|	ПланОбмена КАК ПланОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Справочник.Организации КАК Организации
	|		ПО
	|			НЕ ПланОбмена.ИспользоватьОтборПоОрганизациям
	|";
	
	ПолноеИмяПланаОбмена = УзелИнформационнойБазы.Метаданные().ПолноеИмя();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбмена", ПолноеИмяПланаОбмена);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ОрганизацииПланаОбмена", ПолноеИмяПланаОбмена + ".Организации");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Получатель", УзелИнформационнойБазы);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СписокОрганизаций.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяПланаОбмена);
	ОтмеченныеОрганизации = Менеджер.ОрганизацииИзОтбораИнтерактивнойВыгрузки(ТаблицаОтбора);
	
	Для Каждого ЭлементСписка Из СписокОрганизаций Цикл
		ЭлементСписка.Пометка = ОтмеченныеОрганизации.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РезультатВыбора()
	
	ТаблицаОтбора.Очистить();
	
	СписокОтмеченныхОрганизаций = Новый СписокЗначений;
	СписокОтмеченныхОрганизаций.ЗагрузитьЗначения(ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(СписокОрганизаций));
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(УзелИнформационнойБазы);
	Менеджер.ДобавитьСтрокуОтбораОрганизацийИнтерактивнойВыгрузки(ТаблицаОтбора, ПериодОтбора, СписокОтмеченныхОрганизаций);
	
	НастройкиВыгрузки = Новый Структура;
	НастройкиВыгрузки.Вставить("ПериодОтбора"            , ПериодОтбора);
	НастройкиВыгрузки.Вставить("Отбор"                   , ТаблицаОтбора);
	НастройкиВыгрузки.Вставить("ИспользоватьПериодОтбора", ЗначениеЗаполнено(ПериодОтбора));
	НастройкиВыгрузки.Вставить("ПредставлениеОтбора"     , Менеджер.ПредставлениеОтбораИнтерактивнойВыгрузки(УзелИнформационнойБазы, НастройкиВыгрузки));
	
	НастройкиВыгрузки.Удалить("ИспользоватьПериодОтбора");
	
	Возврат НастройкиВыгрузки;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
